[
    {
        "Hard skills: ": "Basic theory (What is testing, bug reports, documentation, types, methods, testing areas, etc.) SDLC, STLC."
    },
    {
        "Hard skills: ": "What is a client-server architecture."
    },
    {
        "Hard skills: ": "HTTP Methods of requests to the server."
    },
    {
        "Hard skills: ": "HTTP server response codes."
    },
    {
        "Hard skills: ": "Structures of HTTP requests and responses."
    },
    {
        "Hard skills: ": "What is JSON, XML. Their structure."
    },
    {
        "Hard skills: ": "API testing via Postman (JS, API autotests)."
    },
    {
        "Hard skills: ": "Removing and reading logs from an external server."
    },
    {
        "Hard skills: ": "Sniffing http web traffic via Charles and Fiddler."
    },
    {
        "Hard skills: ": "Dev Tools of web browsers (Google Chrome, FireFox)."
    },
    {
        "Hard skills: ": "VPN. (How it works, why you need it, how to use it, tool options)"
    },
    {
        "Hard skills: ": "Mobile testing."
    },
    {
        "Hard skills: ": "Feature iOS, Android, guidelines."
    },
    {
        "Hard skills: ": "Building iOS applications on XCode. (Those who do not have a Mac computer, just look)"
    },
    {
        "Hard skills: ": "Building Android applications on Android Studio."
    },
    {
        "Hard skills: ": "ADB (android device management)."
    },
    {
        "Hard skills: ": "Setting up proxy and vpn on iOS and Android."
    },
    {
        "Hard skills: ": "Interception (sniffing) of mobile traffic via Charles and Fiddler on iOS and Android."
    },
    {
        "Hard skills: ": "Command line (terminal) Linux (copying, creating, viewing, moving files on servers without a graphical interface)"
    },
    {
        "Hard skills: ": "Basics of bash scripting, automation of routine tasks on the server."
    },
    {
        "Hard skills: ": "Access to remote servers."
    },
    {
        "Hard skills: ": "SQL basics (Create, Delete, Drop, Insert Into, Select, From, Where, Join)."
    },
    {
        "Hard skills: ": "Postgres database (installation, configuration and use)."
    },
    {
        "Hard skills: ": "Non-relational database Redis (installation, configuration and use)."
    },
    {
        "Hard skills: ": "Load testing in Jmeter."
    },
    {
        "Hard skills: ": "Scrum development methodology."
    },
    {
        "Hard skills: ": "Test Design Techniques (Equivalence Classes, Boundary Values, Combinatorial Techniques (Pairwise, Orthogonal, Basic Choice, Every Choice), States and Transitions)"
    },
    {
        "Hard skills: ": "Python. (Learning the basics. Creating a client-server application)"
    }
]
